# St7GetNumGeometryFaceEdges

Returns the number of edges in the specified geometry face.

long St7GetNumGeometryFaceEdges(long uID, long FaceNum, long* NumEdges)

Input Parameters

uID

Strand7 model file ID.

FaceNum

Face number.

Output Parameters
NumEdges

Number of edges in the specified face.